tutorials/buoyantSimpleRadiationFoam/hotRadiationRoom/0/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            MarshakRadiation;
        T               T;
        emissivity      1;
        value           uniform 0;
    }

    fixedWalls
    {
        type            MarshakRadiation;
        T               T;
        emissivity      1;
        value           uniform 0;
    }

    ceiling
    {
        type            MarshakRadiation;
        T               T;
        emissivity      1;
        value           uniform 0;
    }

    box
    {
        type            MarshakRadiation;
        T               T;
        emissivity      1;
        value           uniform 0;
    }
}

// ************************************************************************* //
